::带选项的关机

@echo off
:menu
echo ====================================================
echo 请输入要执行的操作:
echo ====================================================
echo.

echo +----------------------------------------------------+
echo +-------1、关机---------+---------2、睡眠------------+
echo +-----------------------+----------------------------+
echo +-------3、重启---------+---------4、退出------------+
echo +----------------------------------------------------+
echo.
set/p num=


if %num% == 1 (
cls
shutdown -s -t 0
goto menu
)

if %num% == 2 (
cls
shutdown -h
goto menu
)

if %num% == 3 (
cls
shutdown -r -t 0
goto menu
)

if %num% ==4 (
cls
exit
)

echo 你输入了%num%，不是可执行命令，请重新输入。
pause
cls
goto menu








