//ÓÃwhile¼ÆËãÊäÈëÊý×ÖµÄ½×³Ë
//±±ÏïµÄÃ¨ 2018.12.22
#include<stdio.h>
void main()
{
	float fac=1;	//¶¨Òå×îÖÕÔËËã½á¹ûÎª¸¡µãÐÍ
	int i = 1,n;
	printf("please inpute a nimber >=0\n");
	scanf("%d",&n);
	if(n == 0 || n == 1){
		printf("factorial is %d\n",1);
		return 0;	//º¯Êýµ½´Ë½áÊø£¬²¢·µ»Øº¯ÊýÖµ 0
	}
	while(i <= n){
		fac = fac*i;
		i++;
	}
	printf("factorial is %.2f\n",fac);	//	.2f ±íÊ¾Êä³öµÄÎ»ÊýÎª2Îª£¬ÆäÖÐµÄ . ²»ÄÜÊ¡ÂÔ
}

/*ÎÊÌâ£º
		Êý¾ÝÀàÐÍÈçºÎÈçºÎ½â¾ö£¿
		ÎªÁË·ÀÖ¹Òç³ö£¬½á¹û¶¨ÒåÎª¸¡µãÐÍ
		Ñ­»·Ìõ¼þÈçºÎ¸ø¶¨£¿
  »ù±¾Ë¼Â·£ºÊäÈëµÄÊý×Ö²¢²»²Î¼ÓÊµ¼ÊÔËËã£¬½öÖ»ÊÇ×÷ÎªÑ­»·±äÁ¿£¬½×³ËÔËËãÓÉ×Ô¼ÓÀ´½â¾ö£¬´ÓÐ¡µ½´ó¿ªÊ¼³Ë*/
