#include <stdio.h>
main()
{
	int a, b, c, x, sum;
	for (x = 1; x <= 5; x++)									/*x的取值范围从1到5*/
	{
		if (10605 % (28-5 * x) == 0)							/*满足条件的x值即为所求*/
		{
			sum = 10605 / (28-5 * x);						/*计算出邮票总数*/
			a = 2 * sum / 10;								/*计算a集邮册中的邮票数*/
			b = 5 * sum / 7;								/*计算b集邮册中的邮票数*/
			c = 303;										/*c集邮册中的有票数*/
			printf("total is %d\n", sum);						/*输出邮票的总数*/
			printf("A:%d\n", a);							/*输出A集邮册中的邮票数*/
			printf("B:%d\n", b);							/*输出B集邮册中的邮票数*/
			printf("C:%d\n", c);								/*输出C集邮册中的邮票数*/
		}
	}
}
